app/Http/Controllers/Company/CompanyController.php

select * from [tbl_company] where [id] in ('75')
---
    public function index()
    {
        $userCompany = $this->userCompanyRepository->where('uid', \Auth::user()->id)->pluck('compid')->toArray();
        // $userCompany = $this->userCompanyRepository->where('uid', \Auth::user()->id)->where('roleid', \Auth::user()->role_id)->pluck('compid')->toArray();
        $company = $this->companyRepository->whereIn('id', $userCompany)->get();